#ifndef CONFIG_H
#define CONFIG_H

#include <stdint.h>
#include <stdbool.h>
#include "gc9a01.h"
#include "fontx.h"

/* ========================================================================== */
/*   ГЛОБАЛЬНЫЕ ПЕРЕМЕННЫЕ ПРОЕКТА (extern)                                   */
/* ========================================================================== */
extern volatile float setpoint_kPa;
extern volatile float pressure1_kPa;
extern bool is_calibrating;
extern uint32_t sum_err;

/* ========================================================================== */
/*   ОБЩИЕ ОБЪЕКТЫ ДИСПЛЕЯ И ШРИФТОВ                                         */
/* ========================================================================== */
extern TFT_t dev;
extern FontxFile fx16[2];

/* ========================================================================== */
/*   ПУБЛИЧНЫЕ ФУНКЦИИ                                                        */
/* ========================================================================== */
void usb_uart_rx_task(void *pvParameters);

#endif // CONFIG_H
